Revit 2024 API
ScheduleFieldMultipleValuesDisplayType Enumeration
 Define how the schedule field's multiple value is displayed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public enum ScheduleFieldMultipleValuesDisplayType
Visual Basic
Public Enumeration ScheduleFieldMultipleValuesDisplayType
Visual C++
public enum class ScheduleFieldMultipleValuesDisplayType
Members
Member name | Description
Project |  Display the project setting [!:Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value].
Varies |  Display a standard hardcoded text, translated for the active locale.
Custom |  Display custom text per [!:Autodesk::Revit::DB::ScheduleField] instance, as defined by the [!:Autodesk::Revit::DB::ScheduleField::MultipleValuesCustomText] property.
See Also
Autodesk.Revit.DB Namespace